//=============================================================================
//
// リザルト画面処理 [result.cpp]
// Author : 川井一生
//
//=============================================================================
#include "main.h"
#include "result.h"

//=============================================================================
// マクロ定義

//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数

//=============================================================================
// 初期化処理
void InitResult(int oldMode)
{
	switch (oldMode)
	{
	case MODE_NULL:
		// 初めての初期化
		/*何も初期化されていあないと想定して、リザルト画面内で使うものを全部初期化*/

		break;
	case MODE_TITLE:
		// タイトルになかった物だけ初期化
		/*タイトル画面からリザルト画面へ切り替わった時に、タイトルで初期化されなかったものを初期化*/
		/*注意*/
		/*タイトル画面で初期化されたものはリセット処理が必要な時がある*/

		//=========================
		// 初期化

		//=========================
		// リセット

		break;
	case MODE_GAME:
		// ゲームになかった物だけ初期化
		/*ゲーム画面からリザルト画面へ切り替わった時に、ゲーム初期化されなかったものを初期化*/
		/*注意*/
		/*ゲーム画面で初期化されたものはリセット処理が必要な時がある*/

		//=========================
		// 初期化

		//=========================
		// リセット


		break;
	}
	return;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitResult(int mode)
{
	switch (mode)
	{
	case MODE_TITLE:
		// タイトルに使わないものをリリース
		/*リザルト画面からタイトル画面へ切り替えるときに、タイトル画面で使わないものをリリース処理をする*/

		break;

	case MODE_GAME:
		// ゲームに使わないものをリリース
		/*リザルト画面からゲーム画面へ切り替えるときに、ゲーム画面で使わないものをリリース処理をする*/

		break;
	}
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateResult(void)
{
	/*ここではほかで書いたアップデートを呼ぶ*/
	/*↓↓↓こんな感じ*/

	//// モデルの最新処理
	//UpdatePlayer();

	//// エネミーの最新処理
	//UpdateEnemy();

	//// NPCの最新処理
	//UpdateNpc();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawResult(void)
{
	/*ここではほかで書いたドローを呼ぶ*/
	/*↓↓↓こんな感じ*/

	//// モデルの描画
	//DrawPlayer();

	//// エネミーの描画
	//DrawEnemy();

	//// NPCの描画処理
	//DrawNpc();
}

